/*
 Немного теории - Отличия class от struct и от enum
 1. В классах есть наследование, в структурах нет
 2. Структуры - это Value Type, классы - это Reference Type
 3. В структурах инициализаторы по умолчанию есть, в классах и енамах нет. В классе нужно написать отдельный инициализатор с помощью ключевого слова init
 Объявление - это когда мы просто дали имя переменной, например, но она не занимает память
 Инициализация - это когда уже в памяти появляется объект заполненный данными
 
 */



//ДЗ 12 - Class vs Struct
//
//Создать класс родитель и 2 класса наследника. Например, родитель - животное, а 2 наследника: жираф и крокодил. Распечатать их общее родительское свойство, а затем уникальные свойства

class Parent {
    
}




//Написать программу, в которой создать класс Car *name*, *countWheels* и несколько методов - *ride*(выводит произведение свойств), *stop*, *explode*




//Создайте Класс с учениками, в котором будет метод, который принимает структуру/класс учеников и сортирует их по оценкам и возвращает отсортированных учеников


//Написать структуру или класс, и показать на примерах, чем отличается структура от класса
